In [ ]:
#In this lab, you will be using the [Sakila]

In [ ]:
#Lab SQL Join 1
1. List number of films per `category`.
2. Display the first and last names, as well as the address, of each staff member.
3. Display the total amount rung up by each staff member in August of 2005.
4. List each film and the number of actors who are listed for that film.
5. Using the tables `payment` and `customer` and the JOIN command, list the total paid by each customer. List the customers alphabetically by last name.

#Lab SQL Join 2
1. Write a query to display for each store its store ID, city, and country.
2. Write a query to display how much business, in dollars, each store brought in.
3. What is the average running time of films by category?
4. Which film categories are longest?
5. Display the most frequently rented movies in descending order.
6. List the top five genres in gross revenue in descending order.
7. Is "Academy Dinosaur" available for rent from Store 1?

In [2]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import matplotlib
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
connection_string = 'mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/sakila'
engine = create_engine(connection_string)

In [5]:
data = pd.read_sql_query('SELECT * FROM sakila.film', engine)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [10]:
#Lab SQL join 1 
#1. List number of films per `category`.
engine.execute("USE sakila")
query = 'select `category_id`, count(film_id) as Films_Total from sakila.film_category fc group by fc.category_id order by category_id asc'
data = pd.read_sql_query(query, engine)
print(data)

    category_id  Films_Total
0             1           64
1             2           66
2             3           60
3             4           57
4             5           58
5             6           68
6             7           62
7             8           69
8             9           73
9            10           61
10           11           56
11           12           51
12           13           63
13           14           61
14           15           74
15           16           57

In [11]:
#2. Display the first and last names, as well as the address, of each staff member.
engine.execute("USE sakila")
query = 'select first_name, last_name, address from sakila.staff s join sakila.address a on s.address_id = a.address_id'
data = pd.read_sql_query(query, engine)
print(data)

  first_name last_name               address
0       Mike   Hillyer     23 Workhaven Lane
1        Jon  Stephens  1411 Lillydale Drive

In [24]:
#3. Display the total amount sold by each staff member in August of 2005.
engine.execute("USE sakila")
query = 'select s.staff_id, sum(amount) as "Total_amount" from sakila.staff s inner join sakila.payment p on s.staff_id = p.staff_id where month(p.payment_date) = 8 and year(p.payment_date) = 2005 group by s.staff_id'
data = pd.read_sql_query(query, engine)
print(data)

   staff_id  Total_amount
0         1      11853.65
1         2      12218.48

In [32]:
#4. List each film and the number of actors who are listed for that film.
engine.execute("USE sakila")
query = 'select f.title, f.film_id, count(actor_id) as "Total_actors" from sakila.film f inner join sakila.film_actor fa on f.film_id = fa.film_id group by f.title, f.film_id'
data = pd.read_sql_query(query, engine)
print(data)

                 title  film_id  Total_actors
0     ACADEMY DINOSAUR        1            10
1       ACE GOLDFINGER        2             4
2     ADAPTATION HOLES        3             5
3     AFFAIR PREJUDICE        4             5
4          AFRICAN EGG        5             5
..                 ...      ...           ...
992     YOUNG LANGUAGE      996             5
993         YOUTH KICK      997             5
994       ZHIVAGO CORE      998             6
995  ZOOLANDER FICTION      999             5
996          ZORRO ARK     1000             3

[997 rows x 3 columns]

In [31]:
#5. Using the tables `payment` and `customer` and the JOIN command, list the total paid by each customer. List the customers alphabetically by last name.
engine.execute("USE sakila")
query = 'select c.first_name, c.last_name, c.customer_id, sum(amount) as "Total_paid" from sakila.customer c inner join sakila.payment p on c.customer_id = p.customer_id group by c.first_name, c.last_name, c.customer_id order by c.last_name'
data = pd.read_sql_query(query, engine)
print(data)

    first_name  last_name  customer_id  Total_paid
0       RAFAEL      ABNEY          505       97.79
1    NATHANIEL       ADAM          504      133.72
2     KATHLEEN      ADAMS           36       92.73
3        DIANA  ALEXANDER           96      105.73
4       GORDON     ALLARD          470      160.68
..         ...        ...          ...         ...
594     BRENDA     WRIGHT           31      104.74
595      BRIAN      WYMAN          318       52.88
596       LUIS      YANEZ          402       79.80
597     MARVIN        YEE          413       75.79
598    CYNTHIA      YOUNG           28      111.68

[599 rows x 4 columns]

In [35]:
#Lab SQL Join 2
#1. Display for each store its store ID, city, and country.
engine.execute("USE sakila")
query = 'select s.store_id, t.city, c.country from sakila.store s join sakila.address a on s.address_id = a.address_id join sakila.city t on a.city_id = t.city_id join sakila.country c on c.country_id = t.country_id'
data = pd.read_sql_query(query, engine)
print(data)

   store_id        city    country
0         1  Lethbridge     Canada
1         2   Woodridge  Australia

In [37]:
#2. How much business, in dollars, each store brought in.
engine.execute("USE sakila")
query = 'select s.store_id, round(sum(amount), 2) from sakila.store s join sakila.customer c on s.store_id = c.store_id join sakila.payment p on c.customer_id = p.customer_id join sakila.rental r on p.rental_id = r.rental_id group by s.store_id'
data = pd.read_sql_query(query, engine)
print(data)

   store_id  round(sum(amount), 2)
0         1               36997.53
1         2               30409.03

In [44]:
# 3. What is the average running time of films by category?
engine.execute("USE sakila")
query = 'select c.name, avg(length) from sakila.film f join sakila.film_category fc on f.film_id = fc.film_id join sakila.category c on fc.category_id = c.category_id group by c.name'
data = pd.read_sql_query(query, engine)
print(data)

           name  avg(length)
0        Action     111.6094
1     Animation     111.0152
2      Children     109.8000
3      Classics     111.6667
4        Comedy     115.8276
5   Documentary     108.7500
6         Drama     120.8387
7        Family     114.7826
8       Foreign     121.6986
9         Games     127.8361
10       Horror     112.4821
11        Music     113.6471
12          New     111.1270
13       Sci-Fi     108.1967
14       Sports     128.2027
15       Travel     113.3158

In [43]:
# 4. Which film categories are longest?
engine.execute("USE sakila")
query = 'select category.name, avg(length) from sakila.film join sakila.film_category using (film_id) join sakila.category using (category_id) group by category.name order by avg(length) desc'
data = pd.read_sql_query(query, engine)
print(data)

           name  avg(length)
0        Sports     128.2027
1         Games     127.8361
2       Foreign     121.6986
3         Drama     120.8387
4        Comedy     115.8276
5        Family     114.7826
6         Music     113.6471
7        Travel     113.3158
8        Horror     112.4821
9      Classics     111.6667
10       Action     111.6094
11          New     111.1270
12    Animation     111.0152
13     Children     109.8000
14  Documentary     108.7500
15       Sci-Fi     108.1967

In [45]:
# 5. Display the most frequently rented movies in descending order.
engine.execute("USE sakila")
query = 'select f.title, count(*) as `Total_rental` from sakila.film f join sakila.inventory i on f.film_id = i.film_id join sakila.rental r on i.inventory_id = r.inventory_id group by f.title order by `Total_rental` desc'
data = pd.read_sql_query(query, engine)
print(data)

                   title  Total_rental
0     BUCKET BROTHERHOOD            34
1       ROCKETEER MOTHER            33
2         GRIT CLOCKWORK            32
3    RIDGEMONT SUBMARINE            32
4         JUGGLER HARDLY            32
..                   ...           ...
953    FREEDOM CLEOPATRA             5
954       TRAFFIC HOBBIT             5
955          TRAIN BUNCH             4
956       HARDLY ROBBERS             4
957          MIXED DOORS             4

[958 rows x 2 columns]

In [46]:
# 6. List the top five genres in gross revenue in descending order.
engine.execute("USE sakila")
query = 'select c.name, fc.category_id, sum(amount) as "gross_revenue" from sakila.payment p join sakila.rental r on p.rental_id = r.rental_id join sakila.inventory i on r.inventory_id = i.inventory_id join sakila.film_category fc on i.film_id = fc.film_id join sakila.category c on c.category_id = fc.category_id group by c.name, fc.category_id order by gross_revenue desc limit 5'
data = pd.read_sql_query(query, engine)
print(data)

        name  category_id  gross_revenue
0     Sports           15        5314.21
1     Sci-Fi           14        4756.98
2  Animation            2        4656.30
3      Drama            7        4587.39
4     Comedy            5        4383.58

In [49]:
# 7. Is "Academy Dinosaur" available for rent from Store 1?
engine.execute("USE sakila")
query = 'select f.film_id, f.title, s.store_id, i.inventory_id from sakila.inventory i join sakila.store s on i.store_id = s.store_id join sakila.film f on i.film_id = f.film_id where f.title = "ACADEMY DINOSAUR" and s.store_id = 1'
data = pd.read_sql_query(query, engine)
print(data)

   film_id             title  store_id  inventory_id
0        1  ACADEMY DINOSAUR         1             1
1        1  ACADEMY DINOSAUR         1             2
2        1  ACADEMY DINOSAUR         1             3
3        1  ACADEMY DINOSAUR         1             4

In [ ]:
Question to teacher : do we have to repeat at each row

engine.execute("USE sakila")
query = ''
data = pd.read_sql_query(query, engine)
print(data)